[
  {
    "question": "Tell me about yourself",
    "category": "General",
    "difficulty": "easy",
    "sample_basic": "I am a software developer with 2 years of experience in Java and Android development. I recently graduated from university with a Computer Science degree and have been working on mobile applications.",
    "sample_intermediate": "I'm a software engineer specializing in mobile application development with 3 years of professional experience. I started my career as a junior Android developer, where I learned Java, Kotlin, and the Android SDK. Over time, I took on more responsibility, leading the development of key features in our flagship app with over 100,000 users.",
    "sample_advanced": "I'm a senior mobile engineer with 5+ years of experience building scalable Android applications. My journey started with a Computer Science degree, followed by working at a startup where I was the lead Android developer. I architected our app from scratch, implemented CI/CD pipelines, and grew the engineering team from 2 to 8 developers. Currently, I'm focused on system design, performance optimization, and mentoring junior developers while continuing to write production code.",
    "keywords": "experience,skills,background,education,achievements,current role",
    "explanation": "Use STAR method: Start with current role (Situation), mention key achievements (Task/Action), and explain what drives you (Result/Goal). Keep it under 2 minutes and focus on relevant technical skills.",
    "practice_template": "I am currently... My background includes... I specialize in... My key achievement was..."
  },
  {
    "question": "What are your greatest strengths?",
    "category": "General",
    "difficulty": "easy",
    "sample_basic": "My greatest strength is problem-solving. I enjoy breaking down complex technical challenges into manageable parts and finding efficient solutions. I also communicate well with team members.",
    "sample_intermediate": "One of my greatest strengths is my ability to quickly learn new technologies and apply them effectively. When our team needed to migrate from Java to Kotlin, I proactively studied the language, built proof-of-concept projects, and helped train other developers. I also excel at debugging complex issues by systematically analyzing logs and using profiling tools.",
    "sample_advanced": "My greatest strength is combining technical expertise with leadership skills. I'm proficient in Android development, system architecture, and performance optimization, but what sets me apart is my ability to mentor junior engineers while maintaining high code quality. For example, I introduced code review standards that reduced production bugs by 40% and implemented a mentorship program that improved our team's retention rate. I balance writing code with strategic planning and team development.",
    "keywords": "technical skills,leadership,problem-solving,communication,learning ability",
    "explanation": "Choose 2-3 strengths backed by specific examples. Focus on technical skills AND soft skills. Use concrete metrics or outcomes to prove your claims.",
    "practice_template": "My key strengths are... For example, I demonstrated this when... The result was..."
  },
  {
    "question": "What are your weaknesses?",
    "category": "General",
    "difficulty": "medium",
    "sample_basic": "I sometimes focus too much on perfecting code details, which can slow me down. I'm working on balancing quality with delivery speed by setting time limits for tasks.",
    "sample_intermediate": "Earlier in my career, I struggled with delegating tasks because I wanted to ensure everything was perfect. When I became a senior developer, I realized this was limiting team growth. I've been actively working on this by mentoring junior developers, conducting thorough code reviews instead of rewriting their code, and trusting the team more. This has improved team productivity by 30% and helped junior developers grow faster.",
    "sample_advanced": "A weakness I've addressed is my tendency to focus heavily on technical excellence at the expense of business context. Two years ago, I spent three weeks optimizing an algorithm that only saved 50ms in a non-critical path. Since then, I've learned to prioritize work based on business impact. Now I start projects by understanding user impact, discussing with product managers, and using data to guide technical decisions. This shift has made me more effective—our last major feature launched 2 weeks early because I focused on high-impact work first.",
    "keywords": "self-awareness,improvement,learning,growth,addressing weakness",
    "explanation": "Choose a REAL weakness but show how you're actively improving it. Avoid clichés like 'perfectionist' or 'work too hard'. Include specific actions you've taken and results achieved.",
    "practice_template": "One area I've worked on is... I noticed this when... I've improved by... Now I..."
  },
  {
    "question": "Tell me about a time you faced a conflict with a team member. How did you handle it?",
    "category": "Behavioral",
    "difficulty": "hard",
    "sample_basic": "I once disagreed with a colleague about which database to use. We talked about the pros and cons of each option and eventually agreed on PostgreSQL because it better fit our needs.",
    "sample_intermediate": "During a sprint planning meeting, a senior developer insisted we use a monolithic architecture for a new feature, while I believed microservices would be more scalable. The disagreement was tense. I scheduled a one-on-one meeting, prepared data on load testing results, and created diagrams showing long-term maintenance costs. We presented both options to the team lead, who decided on a hybrid approach: monolith for MVP with clear service boundaries for future extraction. This taught me the importance of data-driven discussions and compromise.",
    "sample_advanced": "Last year, our tech lead wanted to rewrite our entire codebase from Java to Kotlin immediately, while I argued this would delay critical features by 6 months. The conflict escalated to heated discussions. I approached it systematically: First, I acknowledged his valid concerns about Java's limitations. Then, I proposed a gradual migration strategy—new features in Kotlin, critical modules refactored incrementally. I created a 6-month roadmap showing we could deliver business features while migrating 40% of the codebase. I presented this with metrics on team productivity and risk analysis. The tech lead agreed, and after 6 months, we had migrated 45% of the code while shipping all planned features on time. This taught me that conflicts often arise from different priorities, and the solution is finding common ground with data.",
    "keywords": "communication,conflict resolution,collaboration,compromise,outcome",
    "explanation": "Use STAR method clearly: Situation (what was the conflict?), Task (what needed to be resolved?), Action (specific steps you took—listening, data gathering, proposing solutions), Result (how it ended, what you learned).",
    "practice_template": "Situation: There was a conflict about... Task: I needed to... Action: I approached it by... Result: The outcome was... and I learned..."
  },
  {
    "question": "Describe your greatest professional achievement",
    "category": "Achievement",
    "difficulty": "medium",
    "sample_basic": "My greatest achievement was building my first full Android app during an internship. It had user authentication, database integration, and was deployed to the Play Store with 500+ downloads.",
    "sample_intermediate": "My greatest achievement was leading the development of a new payment feature that increased our app's conversion rate by 25%. The project was challenging because we had to integrate with three different payment gateways while maintaining PCI compliance. I architected the solution using Strategy pattern for flexibility, wrote comprehensive tests, and coordinated with backend, QA, and design teams. The feature launched on time, bug-free, and generated $50,000 in additional revenue in the first month.",
    "sample_advanced": "My most significant achievement was architecting and leading a complete app rewrite that reduced crash rate from 4.2% to 0.3% and improved startup time by 60%. The app had 2 million users and was built on legacy code from 2014. Situation: Users were leaving due to crashes. Task: Modernize architecture without disrupting business. Action: I created a 9-month roadmap, introduced MVVM + Clean Architecture, set up modular structure, implemented Jetpack Compose for UI, established automated testing (unit + integration + UI), and mentored 6 developers through the transition. I ensured we could ship features during the rewrite by using feature flags. Result: Crash-free rate improved to 99.7%, app store rating jumped from 3.8 to 4.6, and development velocity increased by 40% due to better code structure. This achievement demonstrated my ability to balance technical excellence with business continuity.",
    "keywords": "impact,leadership,technical skills,results,business value",
    "explanation": "Choose an achievement with measurable impact. Use STAR method and include numbers: users affected, revenue impact, performance improvements, time saved. Show both technical skills and business impact.",
    "practice_template": "Situation: The challenge was... Task: I needed to achieve... Action: I... Result: The impact was... (use numbers)"
  },
  {
    "question": "Tell me about a time you failed. What did you learn?",
    "category": "Behavioral",
    "difficulty": "hard",
    "sample_basic": "I once missed a deadline because I underestimated how long a feature would take. I learned to break tasks into smaller pieces and give more accurate time estimates.",
    "sample_intermediate": "In my second year as a developer, I pushed a feature with insufficient testing, which caused a critical bug affecting 10,000 users. I had been under pressure to ship quickly and skipped writing integration tests. After the incident, I stayed late fixing the bug, wrote a post-mortem document, and implemented mandatory test coverage requirements (80% unit, 100% critical paths). I also introduced pre-release testing with beta users. This experience taught me that speed without quality is counterproductive, and now I always advocate for proper testing even under tight deadlines.",
    "sample_advanced": "My biggest failure was leading a microservices migration that took 14 months instead of the planned 8 months, causing team burnout and delaying three major features. Situation: Our monolith was slowing development. Task: I proposed splitting it into microservices. Action: I dove into implementation without proper planning—I underestimated inter-service communication complexity, didn't account for data migration challenges, and failed to get buy-in from the team. Result: The project dragged on, morale dropped, and stakeholders lost trust. Learning: I conducted a retrospective, identified root causes—lack of incremental approach, poor change management, and insufficient team input. I've since learned to: 1) Start with thorough planning and architecture reviews, 2) Break large projects into small deliverable milestones, 3) Get team buy-in early, 4) Validate assumptions with prototypes. In my next architecture project, I applied these lessons: we completed it in 6 months with full team support. Failure taught me that technical skills alone aren't enough—project management and people skills are equally critical.",
    "keywords": "failure,learning,growth,self-awareness,improvement",
    "explanation": "Choose a REAL failure (not a humble-brag). Show vulnerability. Use STAR format: clearly describe the failure, take responsibility, explain what you learned, and show how you've applied those lessons since. Employers want self-aware candidates who learn from mistakes.",
    "practice_template": "Situation: I failed when... Task: I was trying to... Action: I made the mistake of... Result: The failure taught me... Now I..."
  },
  {
    "question": "Why do you want to work for this company?",
    "category": "General",
    "difficulty": "easy",
    "sample_basic": "I want to work here because your company builds interesting mobile apps and has a good reputation. I think I can learn a lot and contribute to your projects.",
    "sample_intermediate": "I'm excited about this role because your company focuses on building scalable, user-centric mobile applications, which aligns perfectly with my experience. I've been following your product for 2 years and I'm impressed by your recent migration to Jetpack Compose and clean architecture—technologies I'm passionate about. Additionally, your engineering blog posts about performance optimization resonate with my own approach to development. I'm particularly interested in contributing to your payment features team because I have 3 years of experience in fintech integrations.",
    "sample_advanced": "I'm drawn to this company for three specific reasons. First, your technical culture—your engineering blog demonstrates a commitment to clean architecture, testing, and continuous improvement, which matches my values. I've seen your open-source contributions to the Android community. Second, the business impact: your product serves 5 million users in the e-commerce space, and I'm excited to work at this scale. I have experience building features for apps with similar user bases and understand the performance, reliability, and scalability challenges. Third, growth opportunities: your recent Series B funding and expansion into new markets means I can contribute to architectural decisions while also growing into a tech lead role. I'm particularly interested in your upcoming project to rebuild the checkout flow—my previous work reducing payment conversion drop-off by 30% directly applies here. I want to work with a team that values both technical excellence and business impact.",
    "keywords": "company research,alignment,technical fit,business understanding,growth",
    "explanation": "Research the company deeply. Mention specific products, technologies, blog posts, or recent news. Show how your skills align with their needs. Demonstrate genuine interest beyond salary. Connect their mission to your career goals.",
    "practice_template": "I'm interested in this role because... I've researched your company and... My skills align with your needs in... I'm excited about..."
  },
  {
    "question": "Why should we hire you?",
    "category": "General",
    "difficulty": "medium",
    "sample_basic": "You should hire me because I have strong Android development skills, I'm a quick learner, and I work well in teams. I'm passionate about building great apps.",
    "sample_intermediate": "You should hire me because I bring a unique combination of technical expertise and business focus. I have 4 years of Android development experience with Kotlin, Jetpack, and MVVM architecture. What sets me apart is my track record of delivering features that drive business results—my last project increased user engagement by 35%. I'm also proactive: I don't just write code; I identify problems, propose solutions, and see them through. For example, I noticed our app's crash rate was rising, analyzed crash logs, and implemented a monitoring system that reduced crashes by 50%. I'm self-driven, mentor junior developers, and have experience collaborating with cross-functional teams.",
    "sample_advanced": "You should hire me because I offer three unique values. First, technical depth: I have 6+ years of Android development with expertise in architecture (MVVM, MVI, Clean Architecture), performance optimization, and modern tools (Compose, Coroutines, Hilt). I've built features for apps serving millions of users. Second, business impact: I don't just code—I drive results. At my last company, I led the development of a recommendation engine that increased in-app purchases by 45% ($2M additional revenue annually). I understand user metrics, A/B testing, and how engineering decisions affect business outcomes. Third, leadership and initiative: I mentor developers, conduct architecture reviews, and improve team processes. I introduced automated testing standards that reduced production bugs by 40% and established a tech talk series to share knowledge. I'm not just looking for a job—I'm looking to make a meaningful impact on your product, your team, and your business. Based on your job description, you need someone who can architect scalable solutions, deliver high-quality code, and collaborate effectively—that's exactly what I've been doing for the past 6 years.",
    "keywords": "unique value,technical skills,business impact,results,cultural fit",
    "explanation": "This is your elevator pitch. Highlight what makes you UNIQUE—combine technical skills with soft skills and business impact. Use specific examples and numbers. Show confidence without arrogance. Address the company's needs directly.",
    "practice_template": "You should hire me because... My technical strengths include... I've delivered business results such as... I also bring... What makes me unique is..."
  },
  {
    "question": "Describe a time you had to learn a new technology quickly. How did you approach it?",
    "category": "Technical",
    "difficulty": "medium",
    "sample_basic": "I had to learn Kotlin for a new project. I watched YouTube tutorials, read official documentation, and practiced by building small sample apps. Within 2 weeks, I was comfortable using Kotlin in production.",
    "sample_intermediate": "When our team decided to migrate from Java to Kotlin, I needed to become proficient quickly to lead the migration. I approached this systematically: First, I completed the official Kotlin course by JetBrains (10 hours). Second, I refactored a small module from Java to Kotlin to understand practical differences. Third, I studied Kotlin-specific patterns (sealed classes, extension functions, coroutines) by reading Google's Android Kotlin style guide. Fourth, I built a side project using Kotlin + Compose to gain hands-on experience. Within 3 weeks, I was productive in Kotlin. I then created a migration guide for the team and conducted a workshop to help others transition. The migration was completed in 4 months with zero major issues.",
    "sample_advanced": "Last year, our company needed to integrate machine learning features into our Android app, and I had no ML experience. Situation: Management wanted a personalized recommendation system, and we had a 6-week deadline. Task: Learn ML fundamentals, understand TensorFlow Lite, and implement the feature. Action: I approached this strategically. Week 1: I took Google's ML crash course and studied TensorFlow Lite documentation. Week 2: I experimented with pre-trained models (image classification) to understand integration. Week 3: I collaborated with our data science team to convert our recommendation model to TFLite format. Week 4-5: I implemented the integration, optimizing model inference to run in under 50ms. Week 6: I added A/B testing and monitoring. Result: The feature launched on time, improved click-through rate by 28%, and I became the go-to person for ML integration. Key to my success: I didn't try to become an ML expert; I focused on learning enough to integrate effectively, leveraged experts for help, and prioritized practical implementation over theory. This approach has helped me quickly adopt technologies like Jetpack Compose, Kotlin Coroutines, and GraphQL in previous projects.",
    "keywords": "learning ability,adaptability,resourcefulness,time management,results",
    "explanation": "Use STAR method. Show a structured learning approach (not just 'I read tutorials'). Mention specific resources (courses, docs, books). Highlight how you applied the knowledge practically and achieved results. Demonstrate you can self-teach.",
    "practice_template": "Situation: I needed to learn... Task: The goal was... Action: I approached learning by... Result: I successfully..."
  },
  {
    "question": "Tell me about a time you solved a difficult technical problem",
    "category": "Technical",
    "difficulty": "hard",
    "sample_basic": "Our app was crashing occasionally. I used Android Studio's debugger to trace the issue, found it was a null pointer exception, and fixed it by adding proper null checks.",
    "sample_intermediate": "We had a critical performance issue: our app's RecyclerView was laggy when scrolling through image-heavy lists. Situation: Users complained about poor performance, and our Play Store rating dropped to 3.9. Task: I was tasked with fixing the scroll performance. Action: I used Android Profiler to identify the bottleneck—images were being decoded on the main thread. I refactored the code to use Glide with proper caching, implemented view recycling optimizations, and reduced image sizes using format conversion. I also lazy-loaded images outside the viewport. Result: Scroll performance improved by 70%, frame rate stabilized at 60fps, and our Play Store rating recovered to 4.4 within a month.",
    "sample_advanced": "Last year, our app experienced random crashes affecting 2% of users, but we couldn't reproduce the issue. Situation: Firebase Crashlytics showed 2,000 crashes/day with a vague stack trace pointing to our database layer. Users were frustrated, and we were losing 500 users/week. Task: I needed to find and fix the root cause quickly. Action: I approached this systematically. Step 1: I analyzed Crashlytics logs and noticed crashes correlated with older Android versions (API 24-26). Step 2: I added extensive logging around database operations and released a debug build to affected users. Step 3: Logs revealed the issue: a race condition in our Room database where multiple threads tried to access the database during app startup. The crash occurred when a background sync task conflicted with the main thread's database read. Step 4: I refactored the code to use a single database instance with proper synchronization and implemented a startup initialization sequence to prevent race conditions. I also added database migration tests to catch similar issues in the future. Result: Crashes dropped from 2,000/day to under 50/day (0.1% crash rate). We recovered 80% of lost users, and I documented the issue in a post-mortem to prevent similar problems. This experience taught me the importance of systematic debugging, proper concurrency handling, and comprehensive logging.",
    "keywords": "problem-solving,debugging,technical depth,systematic approach,results",
    "explanation": "Use STAR method with technical details. Describe the problem clearly, explain your debugging/problem-solving process (tools used, steps taken), and quantify the results. Show analytical thinking and technical depth. Employers want to see how you approach complex problems.",
    "practice_template": "Situation: The technical problem was... Task: I needed to... Action: I debugged by... I fixed it by... Result: The outcome was..."
  }
]
