[
{
"id": 1,
"question": "Tell me about yourself.",
"category": "General",
"difficulty": "easy",
"sample_basic": "My name is Quang. I am a software developer with one year of experience. I enjoy solving problems and learning new technologies.",
"sample_intermediate": "I am a software developer specializing in backend development. In the last year, I worked on building REST APIs and improving system performance. I enjoy working in agile teams and learning modern frameworks.",
"sample_advanced": "I’m a backend engineer with experience in designing scalable systems. Recently, I improved API response time by 40% by optimizing caching strategies. I’m passionate about clean architecture, system design, and building solutions that scale.",
"keywords": ["experience", "developer", "backend", "improve", "skills", "team"],
"explanation": "This question tests your ability to summarize your background. Follow the structure: background → experience → strengths → what you’re looking for. Use the STAR method lightly by focusing on relevant IT experiences.",
"practice_template": "I am a __ developer with __ years of experience. Recently, I worked on __. I enjoy __ and __."
},
{
"id": 2,
"question": "What are your strengths?",
"category": "Self-Assessment",
"difficulty": "easy",
"sample_basic": "My strengths are problem-solving and teamwork. I am good at coding and helping my team.",
"sample_intermediate": "One of my key strengths is analytical thinking, which helps me debug complex issues in code quickly. I'm also a strong communicator, enabling me to explain technical concepts to non-technical stakeholders effectively.",
"sample_advanced": "My primary strength is strategic problem-solving; for instance, I led the optimization of a database query that reduced load times by 50%. Additionally, my adaptability allows me to thrive in fast-paced agile environments, mentoring juniors on best practices.",
"keywords": ["problem-solving", "analytical", "communication", "debug", "agile", "optimization"],
"explanation": "Highlight 2-3 strengths with IT-specific examples. Use the STAR method: Situation (context), Task (your role), Action (what you did), Result (outcome). Avoid generic answers; tie to technical skills.",
"practice_template": "One of my strengths is __, for example, when I __. This helped achieve __."
},
{
"id": 3,
"question": "What are your weaknesses?",
"category": "Self-Assessment",
"difficulty": "medium",
"sample_basic": "My weakness is public speaking. I am working on it by practicing more.",
"sample_intermediate": "I sometimes focus too much on details, which can slow down initial progress. To address this, I've adopted time-boxing techniques in my sprints to balance perfection with deadlines.",
"sample_advanced": "Early in my career, I struggled with delegating tasks in team projects, leading to bottlenecks. I've overcome this by implementing pair-programming sessions and using tools like Jira for better task distribution, resulting in 20% faster project delivery.",
"keywords": ["focus", "details", "delegating", "time-boxing", "pair-programming", "jira"],
"explanation": "Choose a real but non-critical weakness, then show how you're improving it. Frame positively with actions and results using STAR to demonstrate growth mindset in an IT context.",
"practice_template": "A weakness I had was __, but I improved by __, leading to __."
},
{
"id": 4,
"question": "Tell me about a conflict you had at work.",
"category": "Teamwork",
"difficulty": "medium",
"sample_basic": "I had a disagreement with a teammate about code. We talked and found a solution.",
"sample_intermediate": "During a project sprint, a colleague and I disagreed on the architecture for a microservice. I initiated a quick retrospective meeting where we reviewed pros and cons, ultimately adopting a hybrid approach that satisfied both sides.",
"sample_advanced": "In a high-stakes deployment, my lead developer and I clashed over prioritizing bug fixes versus new features. I proposed data-driven evidence from user analytics, leading to a compromise that fixed critical issues first and accelerated release by two weeks without compromising quality.",
"keywords": ["disagreement", "retrospective", "architecture", "microservice", "analytics", "deployment"],
"explanation": "Use STAR: Situation (describe conflict), Task (your role), Action (resolution steps), Result (positive outcome). Focus on IT scenarios like code reviews or agile disputes; emphasize collaboration.",
"practice_template": "The conflict was about __. I handled it by __, resulting in __."
},
{
"id": 5,
"question": "Tell me about your greatest achievement.",
"category": "Achievements",
"difficulty": "medium",
"sample_basic": "My greatest achievement was completing a big project on time. It was a team effort.",
"sample_intermediate": "My proudest achievement was developing a feature that integrated third-party APIs, reducing manual data entry by 60% and saving the team hours weekly.",
"sample_advanced": "I spearheaded the migration of our monolithic app to a Kubernetes-based microservices architecture, cutting infrastructure costs by 35% and improving scalability to handle 10x traffic spikes during peak seasons.",
"keywords": ["achievement", "integration", "api", "migration", "kubernetes", "scalability"],
"explanation": "Select an IT accomplishment and structure with STAR: Quantify impact (e.g., percentages, time saved). Highlight technical skills and team contributions for a professional tone.",
"practice_template": "My greatest achievement was __, where I __ and achieved __."
},
{
"id": 6,
"question": "Tell me about a time you failed.",
"category": "Resilience",
"difficulty": "hard",
"sample_basic": "I once missed a deadline because I didn't plan well. I learned to use better tools.",
"sample_intermediate": "I failed to catch a memory leak in production, causing downtime. I conducted a root cause analysis and implemented automated testing, preventing similar issues thereafter.",
"sample_advanced": "During a critical release, my over-optimism on load testing led to a scalability failure under real traffic. I redesigned the caching layer with Redis, incorporated chaos engineering practices, and reduced failure rates by 90% in subsequent deployments.",
"keywords": ["failure", "memory leak", "root cause", "testing", "caching", "chaos engineering"],
"explanation": "Be honest but brief on the failure; focus on learnings and improvements using STAR. In IT, relate to bugs, deadlines, or system issues to show technical maturity.",
"practice_template": "I failed when __. From this, I learned __ and now __."
},
{
"id": 7,
"question": "Why do you want this job?",
"category": "Motivation",
"difficulty": "easy",
"sample_basic": "I want this job because I like the company and the role fits my skills.",
"sample_intermediate": "I'm excited about this role as it aligns with my expertise in cloud-native development, and your team's work on AI-driven analytics matches my interest in scalable data solutions.",
"sample_advanced": "This position appeals to me because it offers the chance to lead DevOps initiatives in a forward-thinking environment like yours, where I can apply my experience in CI/CD pipelines to drive innovation, much like how I optimized deployments at my previous role.",
"keywords": ["aligns", "expertise", "cloud-native", "devops", "ci/cd", "innovation"],
"explanation": "Connect your skills/experience to the company's needs. Use a 3-part structure: What excites you → How you fit → Future contributions. Research the company for IT-specific ties.",
"practice_template": "I want this job because __ aligns with my __. I can contribute by __."
},
{
"id": 8,
"question": "Why should we hire you?",
"category": "Motivation",
"difficulty": "medium",
"sample_basic": "You should hire me because I have good skills and work hard.",
"sample_intermediate": "You should hire me for my proven track record in full-stack development and ability to deliver high-quality code under tight deadlines, as demonstrated in my last project where I refactored legacy code for better maintainability.",
"sample_advanced": "Hire me because I bring a unique blend of technical depth in system design and leadership in cross-functional teams; I've consistently exceeded KPIs, such as reducing bug rates by 45% through TDD adoption, ensuring reliable software for enterprise clients.",
"keywords": ["track record", "full-stack", "refactored", "maintainability", "system design", "tdd"],
"explanation": "Sell your unique value with evidence. Structure: Unique strengths → Specific examples → Benefits to the team. Tailor to IT role with quantifiable achievements.",
"practice_template": "Hire me because of my __ in __. For example, I __, which led to __."
},
{
"id": 9,
"question": "Describe a time when you solved a difficult problem.",
"category": "Problem-Solving",
"difficulty": "medium",
"sample_basic": "I solved a bug in the code by debugging step by step.",
"sample_intermediate": "Faced with a performance bottleneck in our e-commerce app, I profiled the code, identified inefficient queries, and optimized them with indexing, boosting page load speed by 3x.",
"sample_advanced": "When our distributed system experienced intermittent failures due to race conditions, I implemented a saga pattern with event sourcing, coordinated with the team via design reviews, and achieved zero-downtime resilience in production.",
"keywords": ["problem", "debugging", "optimized", "indexing", "saga pattern", "event sourcing"],
"explanation": "Apply STAR fully: Detail the technical challenge and your innovative solution. Emphasize IT tools/methods and measurable results to showcase expertise.",
"practice_template": "The problem was __. I solved it by __, resulting in __."
},
{
"id": 10,
"question": "Describe a time you worked in a team.",
"category": "Teamwork",
"difficulty": "easy",
"sample_basic": "I worked in a team to build an app. We divided tasks and met daily.",
"sample_intermediate": "In a cross-functional team, I collaborated with designers and QA to develop a responsive web app using React and Node.js, conducting daily stand-ups to align on deliverables.",
"sample_advanced": "As part of a remote agile team, I facilitated code reviews and integrated CI/CD pipelines with GitHub Actions, fostering knowledge sharing that shortened our release cycles from bi-weekly to daily without increasing errors.",
"keywords": ["team", "collaborated", "agile", "stand-ups", "ci/cd", "code reviews"],
"explanation": "Use STAR to highlight your role and contributions. Focus on IT collaboration tools/processes like agile, Git, or pair programming to demonstrate professional teamwork.",
"practice_template": "In a team project on __, my role was __. We succeeded by __."
},
{
"id": 11,
"question": "Tell me about a time when you had to learn a new technology quickly.",
"category": "Adaptability",
"difficulty": "medium",
"sample_basic": "I had to learn React for a project. I watched tutorials and practiced coding.",
"sample_intermediate": "When our team switched to Docker for containerization, I completed an online course in two weeks and containerized our legacy app, reducing deployment time from hours to minutes.",
"sample_advanced": "Faced with integrating GraphQL into our RESTful backend under a tight deadline, I prototyped a schema in days using Apollo Server, collaborated on federation strategies, and achieved seamless API evolution with zero downtime.",
"keywords": ["learn", "technology", "docker", "deployment", "graphql", "apollo"],
"explanation": "Use STAR: Situation (urgency), Task (learning goal), Action (methods used), Result (application success). Highlight IT tools and quick impact to show adaptability.",
"practice_template": "I needed to learn __ quickly for __. I did __ and achieved __."
},
{
"id": 12,
"question": "Describe a situation where you had to meet a tight deadline.",
"category": "Time Management",
"difficulty": "medium",
"sample_basic": "I had a deadline for a report. I worked extra hours and finished on time.",
"sample_intermediate": "With a sprint deadline approaching for a mobile app release, I prioritized tasks using Jira, automated testing with Selenium, and delivered the build two days early.",
"sample_advanced": "During a product launch, our CI/CD pipeline broke; I debugged and refactored Jenkins scripts overnight, restoring automated deploys and ensuring on-schedule rollout to 50k users.",
"keywords": ["deadline", "sprint", "jira", "testing", "ci/cd", "jenkins"],
"explanation": "Apply STAR to showcase prioritization and efficiency in IT crunch times. Quantify time saved or risks mitigated for credibility.",
"practice_template": "The deadline was for __. I managed it by __, resulting in __."
},
{
"id": 13,
"question": "Tell me about a time you received feedback and how you acted on it.",
"category": "Growth Mindset",
"difficulty": "easy",
"sample_basic": "My boss said my code was messy. I learned to write cleaner code.",
"sample_intermediate": "In a code review, feedback highlighted my over-reliance on global variables. I refactored to use dependency injection, improving modularity and passing subsequent reviews flawlessly.",
"sample_advanced": "Performance feedback noted gaps in my cloud architecture knowledge; I earned an AWS certification, applied it to redesign our VPC setup, and reduced costs by 25% while enhancing security.",
"keywords": ["feedback", "code review", "refactored", "dependency injection", "aws", "vpc"],
"explanation": "Structure with STAR: Describe feedback, your response, implementation, and positive change. Emphasize continuous improvement in technical skills.",
"practice_template": "The feedback was about __. I acted by __, leading to __."
},
{
"id": 14,
"question": "Describe a time when you innovated to improve a process.",
"category": "Innovation",
"difficulty": "hard",
"sample_basic": "I suggested a new way to test code, which saved time.",
"sample_intermediate": "Noticing slow manual deployments, I scripted an Ansible playbook for orchestration, automating server provisioning and cutting setup time by 70%.",
"sample_advanced": "To combat alert fatigue in our monitoring stack, I developed a ML-based anomaly detection model using TensorFlow, integrated with Prometheus, reducing false positives by 80% and response times.",
"keywords": ["innovated", "process", "ansible", "automation", "ml", "prometheus"],
"explanation": "Use STAR to detail the old process, your idea, execution, and metrics of improvement. Tie to IT efficiency gains.",
"practice_template": "The process needed improvement in __. My innovation was __, achieving __."
},
{
"id": 15,
"question": "Tell me about a time you mentored or trained a colleague.",
"category": "Leadership",
"difficulty": "medium",
"sample_basic": "I helped a new team member learn Git. We practiced together.",
"sample_intermediate": "I mentored a junior dev on unit testing with JUnit, pairing on sessions that boosted their coverage from 20% to 85% in our shared codebase.",
"sample_advanced": "Leading knowledge transfer for a new hire on microservices, I created interactive workshops with Kubernetes labs, accelerating their ramp-up from months to weeks and enhancing team velocity.",
"keywords": ["mentored", "junior", "unit testing", "junit", "kubernetes", "velocity"],
"explanation": "STAR format: Context of mentoring, your approach, actions taken, and colleague's/team's growth. Highlight soft and technical leadership.",
"practice_template": "I mentored on __ by __, resulting in __ for the team."
},
{
"id": 16,
"question": "Describe a challenging project you led.",
"category": "Leadership",
"difficulty": "hard",
"sample_basic": "I led a small app update. We finished it successfully.",
"sample_intermediate": "I led the development of a dashboard using React and Elasticsearch, coordinating a team of three to deliver analytics features ahead of schedule.",
"sample_advanced": "As scrum master for a legacy system refactor to Spring Boot, I managed cross-team dependencies, implemented SAFe practices, and delivered 95% code coverage with 30% faster queries.",
"keywords": ["led", "project", "react", "elasticsearch", "scrum", "safe"],
"explanation": "Employ STAR: Project overview, leadership challenges, strategies used, outcomes. Focus on IT project management tools and results.",
"practice_template": "I led __ project, facing __. I handled it with __, achieving __."
},
{
"id": 17,
"question": "Tell me about a time you handled a difficult customer or stakeholder.",
"category": "Communication",
"difficulty": "medium",
"sample_basic": "A client was upset about a delay. I explained and fixed it.",
"sample_intermediate": "When a stakeholder pushed back on scope changes for our API, I prepared a demo with Postman collections to illustrate benefits, gaining buy-in and proceeding on track.",
"sample_advanced": "Dealing with an executive demanding unrealistic SLAs for our SaaS platform, I presented data visualizations from Grafana showing trade-offs, renegotiated to 99.5% uptime, and implemented monitoring to meet it.",
"keywords": ["stakeholder", "difficult", "demo", "postman", "sla", "grafana"],
"explanation": "STAR: Situation with stakeholder, your communication strategy, actions, resolution. Use IT demos/data to build trust.",
"practice_template": "The issue with the stakeholder was __. I resolved it by __, leading to __."
},
{
"id": 18,
"question": "Describe how you've handled change in your role or team.",
"category": "Adaptability",
"difficulty": "easy",
"sample_basic": "When the team changed tools, I learned them fast.",
"sample_intermediate": "During a company pivot to remote work, I set up secure VPN access with WireGuard and adapted our collaboration to Slack integrations, maintaining productivity.",
"sample_advanced": "Amid a merger-induced tech stack overhaul from .NET to Java, I bridged the transition by authoring migration guides and conducting brown-bag sessions, minimizing knowledge gaps.",
"keywords": ["change", "adapt", "remote", "vpn", "migration", "java"],
"explanation": "Use STAR to show resilience: Change description, personal impact, adaptation steps, benefits. Relate to IT shifts like tools or stacks.",
"practice_template": "The change was __. I adapted by __, resulting in __."
},
{
"id": 19,
"question": "Tell me about a time you went above and beyond for your team.",
"category": "Teamwork",
"difficulty": "medium",
"sample_basic": "I stayed late to help fix a bug for the team.",
"sample_intermediate": "When a teammate was overloaded, I took on their ETL pipeline tasks using Apache Airflow, automating data flows and freeing them for core dev work.",
"sample_advanced": "To support a sprint goal, I volunteered for on-call rotations beyond my shift, resolving a critical PostgreSQL outage with failover scripting, preventing revenue loss.",
"keywords": ["above and beyond", "team", "etl", "airflow", "postgresql", "failover"],
"explanation": "STAR: Team need, your extra effort, specific contributions, impact. Emphasize IT support that drives collective success.",
"practice_template": "I went above for __ by __, which helped __."
},
{
"id": 20,
"question": "Describe a time when you had to prioritize multiple tasks.",
"category": "Time Management",
"difficulty": "medium",
"sample_basic": "I had many tasks, so I listed them and did the important ones first.",
"sample_intermediate": "Juggling bug fixes and new features, I used Eisenhower matrix in Trello to prioritize high-impact items, completing 80% of critical tickets on time.",
"sample_advanced": "In a resource-constrained quarter, I applied MoSCoW method for feature prioritization in our roadmap, integrated with Azure DevOps, aligning delivery with business ROI.",
"keywords": ["prioritize", "tasks", "eisenhower", "trello", "moscow", "azure devops"],
"explanation": "STAR: Overload situation, prioritization technique, execution, results. Reference IT tools for task management.",
"practice_template": "Multiple tasks included __. I prioritized using __, achieving __."
},
{
"id": 21,
"question": "Tell me about your experience with remote or distributed teams.",
"category": "Teamwork",
"difficulty": "easy",
"sample_basic": "I worked remotely and used Zoom for meetings.",
"sample_intermediate": "In a distributed team across time zones, I scheduled async updates via Notion and pair-programmed using VS Live Share, ensuring cohesive code merges.",
"sample_advanced": "Leading a global dev team, I implemented OKRs tracked in Asana and cultural sensitivity training, boosting cross-continent collaboration and on-time delivery by 40%.",
"keywords": ["remote", "distributed", "async", "notion", "okrs", "asana"],
"explanation": "Use STAR: Remote challenges, tools/strategies employed, your role, outcomes. Focus on IT remote work best practices.",
"practice_template": "In remote work on __, I used __ to __."
},
{
"id": 22,
"question": "Describe a time you identified a risk and mitigated it.",
"category": "Risk Management",
"difficulty": "hard",
"sample_basic": "I saw a potential bug and fixed it early.",
"sample_intermediate": "Spotting security vulnerabilities in our auth flow, I conducted a pentest with OWASP ZAP and enforced OAuth2, preventing potential breaches.",
"sample_advanced": "Anticipating scalability risks in peak traffic, I advocated for auto-scaling groups in AWS ECS, stress-tested with Locust, averting downtime during Black Friday surge.",
"keywords": ["risk", "mitigated", "security", "owasp", "auto-scaling", "locust"],
"explanation": "STAR: Risk identification, assessment, mitigation actions, results. IT-specific: security, performance risks.",
"practice_template": "The risk was __. I mitigated by __, avoiding __."
},
{
"id": 23,
"question": "Tell me about a time you contributed to open source or community.",
"category": "Initiative",
"difficulty": "medium",
"sample_basic": "I fixed a bug in a GitHub repo.",
"sample_intermediate": "I contributed a pull request to a popular Node.js library, adding TypeScript support, which was merged and used by 5k+ stars.",
"sample_advanced": "I initiated a community plugin for Grafana alerting via Webhooks, collaborated on GitHub issues, and presented at a meetup, gaining 200+ adopters.",
"keywords": ["open source", "contributed", "pull request", "typescript", "grafana", "webhooks"],
"explanation": "STAR: Contribution context, efforts, collaboration, impact. Show passion for IT community.",
"practice_template": "My contribution to __ was __, resulting in __."
},
{
"id": 24,
"question": "Describe how you stay updated with industry trends.",
"category": "Growth Mindset",
"difficulty": "easy",
"sample_basic": "I read blogs and watch YouTube videos on tech.",
"sample_intermediate": "I follow newsletters like Hacker News and attend webinars on emerging tech like Web3, applying learnings to prototype blockchain integrations.",
"sample_advanced": "I maintain a PKM system with Obsidian for curating insights from conferences like AWS re:Invent, experimenting with AI tools like LangChain in side projects.",
"keywords": ["updated", "trends", "newsletters", "web3", "pkm", "langchain"],
"explanation": "Structure: Methods used, specific resources, application to work. Demonstrate proactive IT learning.",
"practice_template": "I stay updated by __, such as __, and apply to __."
},
{
"id": 25,
"question": "Tell me about a time you dealt with ambiguity in a project.",
"category": "Problem-Solving",
"difficulty": "medium",
"sample_basic": "The requirements were unclear, so I asked questions.",
"sample_intermediate": "With vague specs for a data pipeline, I created wireframes in Lucidchart and iterated with stakeholders, delivering a robust Airflow DAG.",
"sample_advanced": "In an exploratory AI project with undefined KPIs, I defined success metrics using A/B testing frameworks and prototyped with PyTorch, clarifying scope mid-way.",
"keywords": ["ambiguity", "project", "wireframes", "lucidchart", "ab testing", "pytorch"],
"explanation": "STAR: Ambiguous situation, clarification steps, solutions, outcomes. IT: Prototyping, iteration.",
"practice_template": "Ambiguity in __ led me to __, resulting in __."
},
{
"id": 26,
"question": "Describe a situation where you had to say no to a request.",
"category": "Communication",
"difficulty": "hard",
"sample_basic": "I said no to extra work because I was busy.",
"sample_intermediate": "When asked to add unvetted features mid-sprint, I explained capacity limits with burndown charts and proposed backlog prioritization, maintaining velocity.",
"sample_advanced": "Declining a stakeholder's ad-hoc reporting demand due to compliance risks, I offered a secure BI dashboard alternative with Tableau, aligning with GDPR while satisfying needs.",
"keywords": ["say no", "request", "sprint", "burndown", "gdpr", "tableau"],
"explanation": "STAR: Request details, rationale, diplomatic response, alternative. Balance assertiveness in IT contexts.",
"practice_template": "I said no to __ because __, and suggested __."
},
{
"id": 27,
"question": "Tell me about your approach to debugging complex issues.",
"category": "Problem-Solving",
"difficulty": "medium",
"sample_basic": "I use print statements and check logs.",
"sample_intermediate": "For a elusive race condition, I employed strace for system calls and GDB for breakpoints, isolating the thread contention in our multi-threaded app.",
"sample_advanced": "Tackling intermittent API failures, I integrated distributed tracing with Jaeger and correlated logs via ELK stack, pinpointing a network latency bottleneck.",
"keywords": ["debugging", "complex", "race condition", "gdb", "jaeger", "elk"],
"explanation": "Describe systematic approach with STAR-like steps: Tools, process, resolution. Showcase IT debugging arsenal.",
"practice_template": "My approach to debugging __ is __, as in __."
},
{
"id": 28,
"question": "Describe a time you improved team collaboration.",
"category": "Teamwork",
"difficulty": "medium",
"sample_basic": "I started daily check-ins for better communication.",
"sample_intermediate": "To reduce silos, I introduced GitHub Wikis for knowledge sharing and enforced PR templates, streamlining reviews and onboarding.",
"sample_advanced": "Enhancing async comms in a hybrid team, I rolled out Mattermost bots for CI notifications and retrospectives, increasing engagement scores by 35%.",
"keywords": ["collaboration", "team", "github", "pr templates", "mattermost", "retrospectives"],
"explanation": "STAR: Collaboration gap, initiative, implementation, metrics. IT tools for team sync.",
"practice_template": "I improved collaboration by __, leading to __."
},
{
"id": 29,
"question": "Tell me about a time you balanced technical debt with new features.",
"category": "Time Management",
"difficulty": "hard",
"sample_basic": "I fixed old code while adding new stuff.",
"sample_intermediate": "Allocating 20% sprint time for refactoring legacy SQL queries, I balanced with feature delivery, improving query performance without delays.",
"sample_advanced": "In a debt-heavy monolith, I championed 'debt sprints' using SonarQube metrics to guide refactors, paying down 40% tech debt while hitting quarterly goals.",
"keywords": ["technical debt", "balanced", "refactoring", "sonarqube", "monolith", "sprints"],
"explanation": "STAR: Debt vs. features tension, strategy, actions, sustained benefits. IT: Debt measurement tools.",
"practice_template": "Balancing debt in __, I __ to achieve __."
},
{
"id": 30,
"question": "Describe your experience with agile methodologies.",
"category": "Process",
"difficulty": "easy",
"sample_basic": "I use Scrum in my projects with daily meetings.",
"sample_intermediate": "As a dev in Scrum teams, I've facilitated refinements and used story points for estimation, delivering increments consistently.",
"sample_advanced": "Transitioning to SAFe, I scaled agile across programs, coaching POs on WSJF prioritization, resulting in 25% faster value delivery.",
"keywords": ["agile", "scrum", "story points", "safe", "wsjf", "prioritization"],
"explanation": "Share experiences with examples via STAR. Focus on IT agile practices and roles.",
"practice_template": "In agile __, I __ and contributed to __."
},
{
"id": 31,
"question": "Tell me about a time you automated a repetitive task.",
"category": "Efficiency",
"difficulty": "medium",
"sample_basic": "I wrote a script to build the project faster.",
"sample_intermediate": "Tired of manual log analysis, I scripted Python with Pandas to parse and visualize errors, saving hours weekly.",
"sample_advanced": "Automating compliance checks, I built a Terraform module for infrastructure as code audits, integrated with GitHub Actions for PR validation.",
"keywords": ["automated", "task", "script", "pandas", "terraform", "github actions"],
"explanation": "STAR: Repetitive pain, automation solution, tools, time savings. Promote IT automation mindset.",
"practice_template": "I automated __ using __, reducing time by __."
},
{
"id": 32,
"question": "Describe a failure in communication and what you learned.",
"category": "Communication",
"difficulty": "medium",
"sample_basic": "I forgot to update the team, causing confusion.",
"sample_intermediate": "Miscommunicating spec changes via email led to rework; I switched to shared Figma prototypes for clarity, preventing recurrences.",
"sample_advanced": "A handover gap caused deployment issues; post-mortem, I standardized runbooks in Confluence with video walkthroughs, enhancing reliability.",
"keywords": ["communication failure", "learned", "figma", "post-mortem", "confluence", "runbooks"],
"explanation": "STAR on the incident, lessons, improvements. IT: Tools for better docs/handovers.",
"practice_template": "The failure was __. I learned to __."
},
{
"id": 33,
"question": "Tell me about your proudest technical contribution.",
"category": "Achievements",
"difficulty": "medium",
"sample_basic": "I built a useful API for the team.",
"sample_intermediate": "My implementation of Redis caching for session management reduced database hits by 60%, improving app responsiveness.",
"sample_advanced": "Designing a event-driven architecture with Kafka streams for real-time analytics, I enabled sub-second processing for 1M events/day.",
"keywords": ["technical contribution", "proudest", "redis", "caching", "kafka", "event-driven"],
"explanation": "STAR: Contribution details, challenges overcome, tech stack, impact metrics.",
"practice_template": "My proudest contribution was __, using __ to __."
},
{
"id": 34,
"question": "Describe how you handle stress in high-pressure situations.",
"category": "Resilience",
"difficulty": "easy",
"sample_basic": "I take breaks and focus on one thing at a time.",
"sample_intermediate": "During outages, I use breathing techniques and triage with ITIL incident management, restoring services methodically.",
"sample_advanced": "In production crises, I apply chaos engineering mindsets, documenting root causes in PagerDuty playbooks to build antifragile systems.",
"keywords": ["stress", "high-pressure", "triage", "itil", "chaos engineering", "pagerduty"],
"explanation": "Examples with STAR: Stress trigger, coping strategies, IT application, positive results.",
"practice_template": "Under stress from __, I handle by __."
},
{
"id": 35,
"question": "Tell me about a time you influenced a decision at work.",
"category": "Leadership",
"difficulty": "hard",
"sample_basic": "I suggested a better tool and we used it.",
"sample_intermediate": "I influenced adopting Vue.js over Angular by benchmarking prototypes, swaying the tech lead with performance data.",
"sample_advanced": "Advocating for serverless migration, I ROI-modeled with AWS Lambda costs vs. EC2, presented to CTO, securing budget for phased rollout.",
"keywords": ["influenced", "decision", "benchmarking", "vue.js", "serverless", "lambda"],
"explanation": "STAR: Decision context, your advocacy, evidence provided, outcome. Data-driven IT influence.",
"practice_template": "I influenced __ by __, resulting in __."
}
]
